In [1]:
import pandas as pd
import numpy as np

In [2]:
people = {
    "first" : ["Lalit", "Suraj", "Ankit", "Vikash", "Shohel", np.nan, None, "NA"],
    "last" : ["Siraswa", "Dhadeech", "Verma", "Tawar", "Khan", np.nan, np.nan, "Missing"],
    "email" : ["lalitsiraswa@gmail.com", "surajdhadeech@gmail.com", "ankitverma@gmail.com", None, "shohelkhan@gmail.com", "vikashtawar@gmail.com", np.nan, "NA"],
    "age" : ["19", "20", "21", "18", "22", None, None, "Missing"]
}

In [3]:
df = pd.DataFrame(data = people)
df.replace({"NA" : np.nan}, inplace = True)
df.replace({"Missing" : np.nan}, inplace = True)
df

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
3  Vikash     Tawar                     None    18
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None
6    None       NaN                      NaN  None
7     NaN       NaN                      NaN   NaN

In [4]:
df.dropna()

    first      last                    email age
0   Lalit   Siraswa   lalitsiraswa@gmail.com  19
1   Suraj  Dhadeech  surajdhadeech@gmail.com  20
2   Ankit     Verma     ankitverma@gmail.com  21
4  Shohel      Khan     shohelkhan@gmail.com  22

In [5]:
print(df, "\n")
print(df.dropna(axis = "index"), "\n")
print(df.dropna(axis = "index", how = "any"))

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
3  Vikash     Tawar                     None    18
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None
6    None       NaN                      NaN  None
7     NaN       NaN                      NaN   NaN

    first      last                    email age
0   Lalit   Siraswa   lalitsiraswa@gmail.com  19
1   Suraj  Dhadeech  surajdhadeech@gmail.com  20
2   Ankit     Verma     ankitverma@gmail.com  21
4  Shohel      Khan     shohelkhan@gmail.com  22

    first      last                    email age
0   Lalit   Siraswa   lalitsiraswa@gmail.com  19
1   Suraj  Dhadeech  surajdhadeech@gmail.com  20
2   Ankit     Verma     ankitverma@gmail.com  21
4  Shohel      Khan     shohelkhan@gmail.com  22

In [6]:
df

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
3  Vikash     Tawar                     None    18
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None
6    None       NaN                      NaN  None
7     NaN       NaN                      NaN   NaN

In [7]:
df.dropna(axis = "index", how = "all")

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
3  Vikash     Tawar                     None    18
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None

In [8]:
df.dropna(axis = "columns", how = "any")

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7]

In [9]:
df.dropna(subset = ["email"])

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None

In [10]:
df

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
3  Vikash     Tawar                     None    18
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None
6    None       NaN                      NaN  None
7     NaN       NaN                      NaN   NaN

In [11]:
df.dropna(axis = "index", how = "any", subset = ["email"])

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None

In [12]:
df.dropna(axis = "index", how = "any", subset = ["last", "email"])

    first      last                    email age
0   Lalit   Siraswa   lalitsiraswa@gmail.com  19
1   Suraj  Dhadeech  surajdhadeech@gmail.com  20
2   Ankit     Verma     ankitverma@gmail.com  21
4  Shohel      Khan     shohelkhan@gmail.com  22

In [13]:
df

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
3  Vikash     Tawar                     None    18
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None
6    None       NaN                      NaN  None
7     NaN       NaN                      NaN   NaN

In [14]:
df.dropna(axis = "index", how = "all", subset = ["last", "email"])

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
3  Vikash     Tawar                     None    18
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None

In [15]:
df.dropna(axis = "index", how = "any")

    first      last                    email age
0   Lalit   Siraswa   lalitsiraswa@gmail.com  19
1   Suraj  Dhadeech  surajdhadeech@gmail.com  20
2   Ankit     Verma     ankitverma@gmail.com  21
4  Shohel      Khan     shohelkhan@gmail.com  22

In [16]:
df.dropna(axis = "index", how = "all")

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
3  Vikash     Tawar                     None    18
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None

In [17]:
df.dropna(axis = "index", how = "any", subset = ["email"])

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None

In [18]:
df.dropna(axis = "index", how = "all", subset = ["email"])

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None

In [19]:
df

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
3  Vikash     Tawar                     None    18
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None
6    None       NaN                      NaN  None
7     NaN       NaN                      NaN   NaN

In [20]:
df.dropna(axis = "index", how = "all", subset = ["last", "email"])

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
3  Vikash     Tawar                     None    18
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None

In [21]:
df.dropna(axis = "index", how = "any", subset = ["last", "email"])

    first      last                    email age
0   Lalit   Siraswa   lalitsiraswa@gmail.com  19
1   Suraj  Dhadeech  surajdhadeech@gmail.com  20
2   Ankit     Verma     ankitverma@gmail.com  21
4  Shohel      Khan     shohelkhan@gmail.com  22

In [22]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4  False  False  False  False
5   True   True  False   True
6   True   True   True   True
7   True   True   True   True

In [23]:
df

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com    19
1   Suraj  Dhadeech  surajdhadeech@gmail.com    20
2   Ankit     Verma     ankitverma@gmail.com    21
3  Vikash     Tawar                     None    18
4  Shohel      Khan     shohelkhan@gmail.com    22
5     NaN       NaN    vikashtawar@gmail.com  None
6    None       NaN                      NaN  None
7     NaN       NaN                      NaN   NaN

In [24]:
df["age"].fillna(value = 0)

0    19
1    20
2    21
3    18
4    22
5     0
6     0
7     0
Name: age, dtype: object

In [25]:
df.fillna(value = 0)

    first      last                    email age
0   Lalit   Siraswa   lalitsiraswa@gmail.com  19
1   Suraj  Dhadeech  surajdhadeech@gmail.com  20
2   Ankit     Verma     ankitverma@gmail.com  21
3  Vikash     Tawar                        0  18
4  Shohel      Khan     shohelkhan@gmail.com  22
5       0         0    vikashtawar@gmail.com   0
6       0         0                        0   0
7       0         0                        0   0

In [26]:
df["age"].dtype

dtype('O')

In [27]:
df["age"].median()

20.0

In [28]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [29]:
type(np.nan)

float

In [30]:
df["age"].astype("f4")

0    19.0
1    20.0
2    21.0
3    18.0
4    22.0
5     NaN
6     NaN
7     NaN
Name: age, dtype: float32

In [31]:
df["age"] = df["age"].astype(int)

TypeError: int() argument must be a string, a bytes-like object or a number, not 'NoneType'

In [32]:
df["age"] = df["age"].astype(dtype = float)

In [33]:
df

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com  19.0
1   Suraj  Dhadeech  surajdhadeech@gmail.com  20.0
2   Ankit     Verma     ankitverma@gmail.com  21.0
3  Vikash     Tawar                     None  18.0
4  Shohel      Khan     shohelkhan@gmail.com  22.0
5     NaN       NaN    vikashtawar@gmail.com   NaN
6    None       NaN                      NaN   NaN
7     NaN       NaN                      NaN   NaN

In [34]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [35]:
df["age"] = df["age"].astype(dtype = "f8")

In [36]:
df.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [37]:
df["age"].mean()

20.0

In [38]:
df["age"].median()

20.0

In [39]:
df

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com  19.0
1   Suraj  Dhadeech  surajdhadeech@gmail.com  20.0
2   Ankit     Verma     ankitverma@gmail.com  21.0
3  Vikash     Tawar                     None  18.0
4  Shohel      Khan     shohelkhan@gmail.com  22.0
5     NaN       NaN    vikashtawar@gmail.com   NaN
6    None       NaN                      NaN   NaN
7     NaN       NaN                      NaN   NaN

In [40]:
df.ftypes

first     object:dense
last      object:dense
email     object:dense
age      float64:dense
dtype: object

In [41]:
df["first"].unique()

array(['Lalit', 'Suraj', 'Ankit', 'Vikash', 'Shohel', nan, None],
      dtype=object)

In [42]:
df["first"].nunique()

6

In [43]:
df["age"].unique()

array([19., 20., 21., 18., 22., nan])

In [44]:
df["age"].astype(dtype = int)

ValueError: Cannot convert non-finite values (NA or inf) to integer

In [45]:
df

    first      last                    email   age
0   Lalit   Siraswa   lalitsiraswa@gmail.com  19.0
1   Suraj  Dhadeech  surajdhadeech@gmail.com  20.0
2   Ankit     Verma     ankitverma@gmail.com  21.0
3  Vikash     Tawar                     None  18.0
4  Shohel      Khan     shohelkhan@gmail.com  22.0
5     NaN       NaN    vikashtawar@gmail.com   NaN
6    None       NaN                      NaN   NaN
7     NaN       NaN                      NaN   NaN

In [46]:
df["age"].count()

5

In [48]:
df["email"].count()

5